In [1]:
import pandas as pd

In [2]:
df1=pd.read_csv(r"C:\Users\razih\OneDrive\Desktop\New\electronics\Customers.csv",encoding='latin1')
df2=pd.read_csv(r"C:\Users\razih\OneDrive\Desktop\New\electronics\Products.csv",encoding='latin1')
df3=pd.read_csv(r"C:\Users\razih\OneDrive\Desktop\New\electronics\Sales.csv",encoding='latin1')
df4=pd.read_csv(r"C:\Users\razih\OneDrive\Desktop\New\electronics\Stores.csv",encoding='latin1')
df5=pd.read_csv(r"C:\Users\razih\OneDrive\Desktop\New\electronics\Exchange_Rates.csv",encoding='latin1')

In [3]:
cus=df1.copy()
cus.head(5)

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,7/3/1939
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9/27/1979
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,5/26/1947
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,9/17/1957
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,11/19/1965

In [4]:
cus['State Code']=cus['State Code'].dropna()

In [5]:
cus=cus.dropna()

In [6]:
cus.isna().sum()

CustomerKey    0
Gender         0
Name           0
City           0
State Code     0
State          0
Zip Code       0
Country        0
Continent      0
Birthday       0
dtype: int64

In [7]:
cus['Birthday']=pd.to_datetime(cus['Birthday'])
cus.head(2)

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,1939-07-03
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27

In [8]:
cus.to_csv("cus.csv")

In [9]:
pro=df2.copy()
pro.head(2)

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,$6.62,$12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,$6.62,$12.99,101,MP4&MP3,1,Audio

In [10]:
pro.shape

(2517, 10)

In [11]:
# chaging its dtype and replacing few strings

pro['Unit Cost USD'] = pd.to_numeric(pro['Unit Cost USD'].str.replace('$', '').str.replace(',', ''), errors='coerce')
pro['Unit Price USD'] = pd.to_numeric(pro['Unit Price USD'].str.replace('$', '').str.replace(',', ''), errors='coerce')
pro.head(2)

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,6.62,12.99,101,MP4&MP3,1,Audio

In [12]:
pro.to_csv("pro.csv")

In [13]:
sale=df3.copy()
sale.head(2)

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,NaN,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD

In [14]:
sale.shape

(62884, 9)

In [15]:
sale.isna().sum()
sale.drop(['Delivery Date'],axis=1,inplace=True)

In [16]:
sale.head(1)

,Order Number,Line Item,Order Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,265598,10,1304,1,CAD

In [17]:
sale['Order Date']=pd.to_datetime(sale['Order Date'])
sale.head(2)

,Order Number,Line Item,Order Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,2016-01-01,265598,10,1304,1,CAD
1,366001,1,2016-01-01,1269051,0,1048,2,USD

In [18]:
sale.shape

(62884, 8)

In [19]:
sale.to_csv("sale.csv")

In [20]:
store=df4.copy()
store.head(2)

   StoreKey    Country                         State  Square Meters  Open Date
0         1  Australia  Australian Capital Territory          595.0   1/1/2008
1         2  Australia            Northern Territory          665.0  1/12/2008

In [21]:
store.isna().sum()
store.dropna()
store.head(2)

   StoreKey    Country                         State  Square Meters  Open Date
0         1  Australia  Australian Capital Territory          595.0   1/1/2008
1         2  Australia            Northern Territory          665.0  1/12/2008

In [22]:
store['Open Date']=pd.to_datetime(store['Open Date'])
store.head(2)

   StoreKey    Country                         State  Square Meters  Open Date
0         1  Australia  Australian Capital Territory          595.0 2008-01-01
1         2  Australia            Northern Territory          665.0 2008-01-12

In [23]:
store.shape

(67, 5)

In [24]:
store.to_csv("store.csv")

In [25]:
ex=df5.copy()
ex.head(2)

       Date Currency  Exchange
0  1/1/2015      USD    1.0000
1  1/1/2015      CAD    1.1583

In [26]:
ex['Date']=pd.to_datetime(ex['Date'])
#ex.head(2)

ex=ex.rename(columns={'Date': 'Record_Date'})# Rename a single column
ex.head(2)

  Record_Date Currency  Exchange
0  2015-01-01      USD    1.0000
1  2015-01-01      CAD    1.1583

In [27]:
ex.shape

(11215, 3)

In [28]:
ex.to_csv("ex.csv")

# merging data frames by commmon columns

In [29]:
cus_df=pd.read_csv(r"C:\Users\razih\OneDrive\Desktop\New\electronics\cus.csv")
cus_df=cus_df.drop(['Unnamed: 0'],axis=1)
cus_df.head(2)
#cus.shape

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,1939-07-03
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27

In [30]:
sale_df=pd.read_csv(r"C:\Users\razih\OneDrive\Desktop\New\electronics\sale.csv")
sale_df=sale_df.drop(['Unnamed: 0'],axis=1)
sale_df.head(2)
#sale_df.shape

,Order Number,Line Item,Order Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,2016-01-01,265598,10,1304,1,CAD
1,366001,1,2016-01-01,1269051,0,1048,2,USD

In [31]:
cus_sale=pd.merge(cus_df,sale_df, on='CustomerKey')
cus_sale.head(2)

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday,Order Number,Line Item,Order Date,StoreKey,ProductKey,Quantity,Currency Code
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,1939-07-03,1776007,1,2019-11-11,0,53,2,AUD
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27,1109001,1,2018-01-13,6,443,4,AUD

In [32]:
cus_sale.shape

(62854, 17)

In [33]:
pro_df = pd.read_csv(r"C:\Users\razih\OneDrive\Desktop\New\electronics\pro.csv")
pro_df.drop(['Unnamed: 0'],axis=1,inplace=True)
pro_df.head(2)

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,6.62,12.99,101,MP4&MP3,1,Audio

In [34]:
pro_sale = pd.merge(pro_df,sale_df, on='ProductKey')
pro_sale.head(2)

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category,Order Number,Line Item,Order Date,CustomerKey,StoreKey,Quantity,Currency Code
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio,493001,3,2016-05-07,453993,0,1,EUR
1,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio,728016,1,2016-12-28,1513119,47,1,USD

In [35]:
pro_sale.shape

(62884, 17)

In [36]:
store_df=pd.read_csv(r"C:\Users\razih\OneDrive\Desktop\New\electronics\store.csv")
store_df.drop(['Unnamed: 0'],axis=1,inplace=True)
store_df.head(2)

,StoreKey,Country,State,Square Meters,Open Date
0,1,Australia,Australian Capital Territory,595.0,2008-01-01
1,2,Australia,Northern Territory,665.0,2008-01-12

In [37]:
store_df.dropna(inplace=True)

In [38]:
store_sale = pd.merge(sale_df,store_df, on ='StoreKey')
store_sale.head(2)

,Order Number,Line Item,Order Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code,Country,State,Square Meters,Open Date
0,366000,1,2016-01-01,265598,10,1304,1,CAD,Canada,Nunavut,1210.0,2015-04-04
1,366004,1,2016-01-01,1107461,38,163,6,GBP,United Kingdom,Belfast,1800.0,2015-04-04

In [39]:
store_sale.dropna(inplace=True)

In [40]:
store_sale.shape

(49719, 12)

In [41]:
ex_df=pd.read_csv(r"C:\Users\razih\OneDrive\Desktop\New\electronics\ex.csv")
ex_df.drop(['Unnamed: 0'],axis=1,inplace=True)
ex_df.head(2)

  Record_Date Currency  Exchange
0  2015-01-01      USD    1.0000
1  2015-01-01      CAD    1.1583

In [42]:
ex_sale=pd.merge(sale_df,ex_df, left_on=['Order Date','Currency Code'], right_on=['Record_Date','Currency'])
ex_sale.head(2)

,Order Number,Line Item,Order Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code,Record_Date,Currency,Exchange
0,366000,1,2016-01-01,265598,10,1304,1,CAD,2016-01-01,CAD,1.3884
1,366001,1,2016-01-01,1269051,0,1048,2,USD,2016-01-01,USD,1.0000

In [43]:
ex_sale.shape

(62884, 11)

In [44]:
cus_sale_pro =pd.merge(cus_sale,pro_df, on='ProductKey')
cus_sale_pro.head(2)

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday,...,Currency Code,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,1939-07-03,...,AUD,WWI 4GB Video Recording Pen X200 Black,Wide World Importers,Black,98.07,296.0,104,Recording Pen,1,Audio
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27,...,AUD,WWI Desktop PC3.0 M0300 Silver,Wide World Importers,Silver,160.49,349.0,303,Desktops,3,Computers

In [59]:
cus_sale_pro.shape

(62854, 26)

In [45]:
cus_sale_pro_store=pd.merge(cus_sale_pro,store_df, on='StoreKey')
cus_sale_pro_store.head(2)

,CustomerKey,Gender,Name,City,State Code,State_x,Zip Code,Country_x,Continent,Birthday,...,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category,Country_y,State_y,Square Meters,Open Date
0,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27,...,160.49,349.0,303,Desktops,3,Computers,Australia,Western Australia,2000.0,2010-01-01
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27,...,72.66,158.0,306,"Printers, Scanners & Fax",3,Computers,Australia,Western Australia,2000.0,2010-01-01

In [60]:
cus_sale_pro_store.shape

(49691, 30)

In [55]:
cus_sale_pro_store.columns

Index(['CustomerKey', 'Gender', 'Name', 'City', 'State Code', 'State_x',
       'Zip Code', 'Country_x', 'Continent', 'Birthday', 'Order Number',
       'Line Item', 'Order Date', 'StoreKey', 'ProductKey', 'Quantity',
       'Currency Code', 'Product Name', 'Brand', 'Color', 'Unit Cost USD',
       'Unit Price USD', 'SubcategoryKey', 'Subcategory', 'CategoryKey',
       'Category', 'Country_y', 'State_y', 'Square Meters', 'Open Date'],
      dtype='object')

In [46]:
cus_sale_pro_store_ex=pd.merge(cus_sale_pro_store,ex_df, left_on=['Order Date','Currency Code'], right_on=['Record_Date','Currency'])
cus_sale_pro_store_ex.head(2)

,CustomerKey,Gender,Name,City,State Code,State_x,Zip Code,Country_x,Continent,Birthday,...,Subcategory,CategoryKey,Category,Country_y,State_y,Square Meters,Open Date,Record_Date,Currency,Exchange
0,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27,...,Desktops,3,Computers,Australia,Western Australia,2000.0,2010-01-01,2018-01-13,AUD,1.2702
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27,...,"Printers, Scanners & Fax",3,Computers,Australia,Western Australia,2000.0,2010-01-01,2018-01-13,AUD,1.2702

In [47]:
cus_sale_pro_store_ex.shape

(49691, 33)

In [48]:
cus_sale_pro_store_ex.to_csv("all_df.csv")

In [54]:
import pymysql

connection = pymysql.connect(
    host='localhost',
    user='root',
    password='123456789',
    database='DATASPARK'
)
cursor=connection.cursor()
cursor

In [ ]:
# Creating Table Sales_Customer_Product_Store['CustomerKey', 'Gender', 'Name', 'City', 'State Code', 'State_x',
       #'Zip Code', 'Country_x', 'Continent', 'Birthday', 'Order Number',
       #'Line Item', 'Order Date', 'StoreKey', 'ProductKey', 'Quantity',
       #'Currency Code', 'Product Name', 'Brand', 'Color', 'Unit Cost USD',
       #'Unit Price USD', 'SubcategoryKey', 'Subcategory', 'CategoryKey',
      # 'Category', 'Country_y', 'State_y', 'Square Meters', 'Open Date']
query=""" CREATE TABLE Customer_Product_Sale(
        ID INT AUTO_INCREMENT PRIMARY KEY,
        CustomerKey INT, 
        Gender VARCHAR(25) NOT NULL ,
        Customer_Name VARCHAR(50) NOT NULL,
        City VARCHAR(50) NOT NULL,
        State_Code VARCHAR(50) NOT NULL,
        State_x VARCHAR(50) NOT NULL,
        Zip_Code VARCHAR(10) NOT NULL,
        Country_x VARCHAR(50) NOT NULL,
        Continent VARCHAR(50) NOT NULL,
        Birthday VARCHAR(50) NOT NULL,
        Order_Number INT,
        Line_Item INT,
        Order_Date VARCHAR(50) NOT NULL,
        StoreKey INT,
        ProductKey INT,
        Quantity INT,
        Currency_Code VARCHAR(50) NOT NULL,
        Product_Name VARCHAR(150) NOT NULL,
        Brand VARCHAR(50) NOT NULL,
        Color VARCHAR(50) NOT NULL,
        Unit_Cost_USD FLOAT,
        Unit_Price_USD FLOAT,
        SubcategoryKey INT,
        Subcategory VARCHAR(50) NOT NULL,
        CategoryKey INT,
        Category VARCHAR(50) NOT NULL,
        Country_y VARCHAR(50) NOT NULL,
        State_y VARCHAR(50) NOT NULL,
        Square_Meters FLOAT,
        Open_Date VARCHAR(50) NOT NULL)"""
cursor.execute(query)

print("Table Created successfully")

Table Created successfully

In [57]:
# Inserting data into Sales_Customer table['CustomerKey', 'Gender', 'Name', 'City', 'State Code', 'State_x',
       #'Zip Code', 'Country_x', 'Continent', 'Birthday', 'Order Number',
       #'Line Item', 'Order Date', 'StoreKey', 'ProductKey', 'Quantity',
       #'Currency Code', 'Product Name', 'Brand', 'Color', 'Unit Cost USD',
       #'Unit Price USD', 'SubcategoryKey', 'Subcategory', 'CategoryKey',
      # 'Category', 'Country_y', 'State_y', 'Square Meters', 'Open Date']
insert_query = '''INSERT INTO Sales_Customer_Product_Store(
            CustomerKey,
            Gender,
            Customer_Name,
            City,
            State_Code,
            State_x,
            Zip_Code,
            Country_x,
            Continent,
            Birthday, 
            Order_Number,
            Line_Item,
            Order_Date,
            StoreKey,
            ProductKey,
            Quantity,
            Currency_Code,
            Product_Name,
            Brand,
            Color,
            Unit_Cost_USD,
            Unit_Price_USD,
            SubcategoryKey,
            Subcategory,
            CategoryKey,
            Category,
            Country_y,
            State_y,
            Square_Meters,
            Open_Date
            )
        VALUES(%s, %s, %s, %s, %s, %s,
               %s, %s, %s, %s, %s, %s,
               %s, %s, %s, %s, %s, %s,
               %s, %s, %s, %s, %s, %s,
               %s, %s, %s, %s, %s, %s)'''
data = cus_sale_pro_store.values.tolist()

cursor.executemany(insert_query, data)

connection.commit()

print("Values inserted successfully")

Values inserted successfully

In [58]:
query="select * from Sales_Customer_Product_Store" 
cursor.execute(query)
for i in cursor:
    print(i)
    break

(1, 325, 'Female', 'Madison Hull', 'MOUNT BUDD', 'WA', 'Western Australia', '6522', 'Australia', 'Australia', '1979-09-27', 1109001, 1, '2018-01-13', 6, 443, 4, 'AUD', 'WWI Desktop PC3.0 M0300 Silver', 'Wide World Importers', 'Silver', 160.49, 349.0, 303, 'Desktops', 3, 'Computers', 'Australia', 'Western Australia', 2000.0, '2010-01-01')

In [62]:
'''['CustomerKey', 'Gender', 'Name', 'City', 'State Code', 'State',
       'Zip Code', 'Country', 'Continent', 'Birthday', 'Order Number',
       'Line Item', 'Order Date', 'StoreKey', 'ProductKey', 'Quantity',
       'Currency Code', 'Product Name', 'Brand', 'Color', 'Unit Cost USD',
       'Unit Price USD', 'SubcategoryKey', 'Subcategory', 'CategoryKey',
       'Category']'''
query=""" CREATE TABLE Customer_Product_Sale(
        ID INT AUTO_INCREMENT PRIMARY KEY,
        CustomerKey INT, 
        Gender VARCHAR(25) NOT NULL ,
        Customer_Name VARCHAR(50) NOT NULL,
        City VARCHAR(50) NOT NULL,
        State_Code VARCHAR(50) NOT NULL,
        State VARCHAR(50) NOT NULL,
        Zip_Code VARCHAR(10) NOT NULL,
        Country VARCHAR(50) NOT NULL,
        Continent VARCHAR(50) NOT NULL,
        Birthday VARCHAR(50) NOT NULL,
        Order_Number INT,
        Line_Item INT,
        Order_Date VARCHAR(50) NOT NULL,
        StoreKey INT,
        ProductKey INT,
        Quantity INT,
        Currency_Code VARCHAR(50) NOT NULL,
        Product_Name VARCHAR(150) NOT NULL,
        Brand VARCHAR(50) NOT NULL,
        Color VARCHAR(50) NOT NULL,
        Unit_Cost_USD FLOAT,
        Unit_Price_USD FLOAT,
        SubcategoryKey INT,
        Subcategory VARCHAR(50) NOT NULL,
        CategoryKey INT,
        Category VARCHAR(50) NOT NULL )"""
cursor.execute(query)

print("Table Created successfully")

Table Created successfully

In [73]:
# Creating Table Customers
cursor.execute('''CREATE TABLE Customer(
        ID INT AUTO_INCREMENT PRIMARY KEY,
        CustomerKey INT,
        Gender VARCHAR(25) NOT NULL ,
        Customer_Name VARCHAR(50) NOT NULL,
        City VARCHAR(50) NOT NULL,
        State_Code VARCHAR(50) NOT NULL,
        State VARCHAR(50) NOT NULL,
        Zip_Code VARCHAR(10) NOT NULL,
        Country VARCHAR(50) NOT NULL,
        Continent VARCHAR(50) NOT NULL,
        Birthday VARCHAR(50) NOT NULL
    )''')
print("Table Created successfully")

Table Created successfully

In [74]:
# Inserting data into Customer table
insert_query = '''INSERT INTO Customer(
                    CustomerKey,
                    Gender,
                    Customer_Name,
                    City,
                    State_Code,
                    State,
                    Zip_Code,
                    Country,
                    Continent,
                    Birthday
                    )
                  VALUES(%s, %s, %s, %s, %s, %s, %s, %s, %s, %s)'''
data = cus_df.values.tolist()

cursor.executemany(insert_query, data)

connection.commit()

print("Values inserted successfully")

Values inserted successfully

In [75]:
# Creating Table Sales
cursor.execute('''CREATE TABLE Sale(
        ID INT AUTO_INCREMENT PRIMARY KEY,
        Order_Number INT,
        Line_Item INT,
        Order_Date VARCHAR(50) NOT NULL,
        CustomerKey INT,
        StoreKey INT,
        ProductKey INT,
        Quantity INT,
        Currency_Code VARCHAR(50) NOT NULL
    )''')
print("Table Created successfully")

Table Created successfully

In [76]:
# Inserting data into Sales table
insert_query = '''INSERT INTO Sale(
            Order_Number,
            Line_Item,
            Order_Date,
            CustomerKey,
            StoreKey,
            ProductKey,
            Quantity,
            Currency_Code
            )
        VALUES(%s, %s, %s, %s, %s, %s, %s, %s)'''
data = sale_df.values.tolist()

cursor.executemany(insert_query, data)

connection.commit()

print("Values inserted successfully")

Values inserted successfully

In [77]:
# Creating Table Product
cursor.execute('''CREATE TABLE Product(
        ID INT AUTO_INCREMENT PRIMARY KEY,
        ProductKey INT,
        Product_Name VARCHAR(150) NOT NULL,
        Brand VARCHAR(50) NOT NULL,
        Color VARCHAR(50) NOT NULL,
        Unit_Cost_USD FLOAT,
        Unit_Price_USD FLOAT,
        SubcategoryKey INT,
        Subcategory VARCHAR(50) NOT NULL,
        CategoryKey INT,
        Category VARCHAR(50) NOT NULL
    )''')
print("Table Created successfully")

Table Created successfully

In [78]:
# Inserting data into Product table
insert_query = '''INSERT INTO Product(
            ProductKey,
            Product_Name,
            Brand,
            Color,
            Unit_Cost_USD,
            Unit_Price_USD,
            SubcategoryKey,
            Subcategory,
            CategoryKey,
            Category
            )
        VALUES(%s, %s, %s, %s, %s, %s, %s, %s, %s, %s)'''
data = pro_df.values.tolist()

cursor.executemany(insert_query, data)

connection.commit()

print("Values inserted successfully")

Values inserted successfully

In [79]:
# Creating Table Stores
cursor.execute('''CREATE TABLE Store(
        ID INT AUTO_INCREMENT PRIMARY KEY,
        StoreKey INT,
        Country VARCHAR(50) NOT NULL,
        State VARCHAR(50) NOT NULL,
        Square_Meters FLOAT,
        Open_Date VARCHAR(50) NOT NULL
    )''')
print("Table Created successfully")

Table Created successfully

In [80]:
# Inserting data into Store table
insert_query = '''INSERT INTO Store(
            StoreKey ,
            Country,
            State,
            Square_Meters,
            Open_Date
            )
        VALUES(%s, %s, %s, %s, %s)'''
data = store_df.values.tolist()

cursor.executemany(insert_query, data)

connection.commit()

print("Values inserted successfully")

Values inserted successfully

In [81]:
# Creating Table Exchange_Rate
cursor.execute('''CREATE TABLE Exchange_Rate(
        ID INT AUTO_INCREMENT PRIMARY KEY,
        Record_Date VARCHAR(50) NOT NULL,
        Currency VARCHAR(50) NOT NULL,
        Exchange_Rate FLOAT
    )''')
print("Table Created successfully")

Table Created successfully

In [82]:
# Inserting data into Exchange_Rate table
insert_query = '''INSERT INTO Exchange_Rate(
            Record_Date,
            Currency,
            Exchange_Rate
            )
        VALUES(%s, %s, %s)'''
data = ex_df.values.tolist()

cursor.executemany(insert_query, data)

connection.commit()

print("Values inserted successfully")

Values inserted successfully

In [85]:
query="show tables"
cursor.execute(query)
for i in cursor:
    print(i)

('customer',)
('exchange_rate',)
('product',)
('sale',)
('sales_customer_product_store',)
('store',)

In [84]:
query="drop table Customer_Product_Sale"
cursor.execute(query)

0